# [2진수 <-> 16진수]
# - 2진수일 시 4개씩 끊어서 이진수로 변환
# [10진수 <-> 16진수]
# - 16진수로 만들기 : 10 / 16 .. -> 몫 / 16 반복 나머지를 거꾸로 읽음. 
#  200 / 16 = 12..8 , 12/ 16 = 0…12 (종료) -> 거꾸로 읽기 C8(나머지만) 
# - 10진수로 만들기 : 자리별 16^n ex) 1A  = 16^1 * 1 + 10 ^ 16^0
#python slicing : 이상 : 미만 


# vpn ,  ipsec 기업 중심, ssl 웹 중심 


# 웹의 구성 요소 HYPERTEXT, HTML (DHTML 동적),  HTTP(80), HTTPS(443 SSL 넣음.) 



# [STATE]
# -	RAID 란 ? 여러 하드디스크, 데이터(파일)를 분산하여 저장 

# [CONNECTION]
# -	RAID 0 : 스트라이핑 (데이터 나누어 저장 -> 같이 읽음, 속도 ^)
# -	RAID 1 : 미러링 (같은 데이터 복사 저장, 안전)
# -	RAID 5 : 데이터, 패리티 분산 저장 (패리티 : 데이터 복구 방법), 3개 이상
# -	RAID 6 : 듀얼 패리티 (패리티를 2개 분산 저장), 4개 이상 


# -	Python : & 비트 연산, and 논리 연산 
# -	C 언어 : & 비트 연산, && 논리 연산
# -	JAVA : & if 문 내 논리, if 문 밖 비트연산, && 논리 연산 


#보안
# SYN FLOODING (TCP, 대기상태), Session Hijacking(비동기, 시퀀스 넘버 탈취), Sniffing (패킷 도청), Smurf(ICMP DDos)